[
  {
    "path": "posts/2021-12-06-kaggle/",
    "title": "Data Science Career Paths & Skillsets in 2021",
    "description": "A final project of ANLY-511: Prob Modeling/Stat Computing at Georgetown University.",
    "author": [
      {
        "name": "Jingsong Gao",
        "url": "https://github.com/jingshenSN2"
      },
      {
        "name": "Ercong Luo",
        "url": "https://github.com/ErcongLuo"
      },
      {
        "name": "Rui Qiu",
        "url": "https://github.com/rexarski"
      }
    ],
    "date": "2022-12-06",
    "categories": [],
    "contents": "\nA final project of ANLY-511: Prob Modeling/Stat Computing at Georgetown University.\nPresented by:\nJingsong Gao, jg2109@georgetown.edu\nErcong Luo, el890@georgetown.edu\nRui Qiu, rq47@georgetown.edu\n🔗See the published page.\n\n\n\n",
    "preview": "posts/2021-12-06-kaggle/images/kaggle.png",
    "last_modified": "2022-01-01T20:38:59-05:00",
    "input_file": {},
    "preview_width": 1536,
    "preview_height": 960
  },
  {
    "path": "posts/2021-12-01-eli5c/",
    "title": "A Constrained Long-form Question Answering (LFQA) Model on eli5_category",
    "description": "A final project of ANLY-580: NLP for Data Analytics at Georgetown University.",
    "author": [
      {
        "name": "Jingsong Gao",
        "url": "https://github.com/jingshenSN2"
      },
      {
        "name": "Qinren Zhou",
        "url": "https://github.com/QinrenZhou"
      },
      {
        "name": "Rui Qiu",
        "url": "https://github.com/rexarski"
      }
    ],
    "date": "2022-12-01",
    "categories": [],
    "contents": "\nA final project of ANLY-580: NLP for Data Analytics at Georgetown University.\nimg\nCredit: Darren Lebeuf\n\n1. Introduction\nThe search engines nowadays enable us to ask any questions as a search query. However, when it comes to a scientific question, the answer to that question could be either not accurate enough or too specialized to understand. For instance, to fully apprehend a Wikipedia page, one might need much prior knowledge in a particular area.\nPrior research on long-form question answering aims to fix this issue. ELI5: Long Form Question Answering by Facebook (2019) and Hurdles to Progress in Long-form Question Answering by Google (2021) are two representative papers in this area. Facebook created the ELI5 dataset and used the ROUGE-L metric to evaluate the long-form answers in their paper, which the dataset and metric widely used in later research. However, Google’s paper pointed out that the dataset has severe train/validation overlapping and the metric showing a lack of distinction between random answers and gold answers.\nTherefore, instead of training models on a dataset with potential issues and gaining higher grades using an invalid metric, our project will focus on recreating a categorized ELI5 dataset and proposing more discriminatory metrics for this LFQA task.\n2. Dataset\n2.1 Source\nThe subreddit r/explainlikeim5 (ELI5) from Reddit is a worthy training dataset. Users in this subreddit are known for their objective, thorough and intuitive explanations of various questions. ELI5 is appealing because answers are supposed to be entirely self-contained and thus rely less on pre-existing knowledge of the world and use more straightforward language that is easier to model.\n2.2 Facebook’s ELI5\nThe ELI5 dataset created by Facebook contains more than 270,000 posts in the subreddit from 2012 to 2019, and each post consists of a scientific question and some easy-to-understand answers.\n2.3 Issues of Uncategorized Data\nIn Google AI Blog’s post Progress and Challenges in Long-Form Open-Domain Question Answering, researchers addressed three concerning trends in the progress of building a more sensible model:\nMany held-out questions are paraphrased in the training set. This is caused by the fact that even though the subreddit /r/explainlikeim5 is clearly against repeated questions, it is simply unavoidable.\nROGUE metric is not always a good evaluation standard. This one is actually not related to the uncategorized characteristic of the data, but we will mention it again in the later section.\nThe third issue comes as the byproduct of previous two. If we set an answer conditionally generated on random documents, instead of relevant documents, it still can provide a “correct” and factual answer. And at the same time, the longer answer has a higher ROGUE-L score.\nWe aim to tackle the first issue our categorized version of data.\n2.4 Our ELI5_Category\nSo the main question here is: Why categorize the data?\nRecall the overlapping issue we metioned earlier. The most straightforward solution to this is to figure out why the overlapping occurs, then we can purposefully resolve it.\nWith the introduction of the thread tagging system in 2017, the questions that appeared in the subreddit are more organized in such a manner. As a result, if we take a random sample collections of questions as the training set, and the sample size is large enough, it barely impossible to neglect the fact some questions would be repetitive or overlapping.\nIn order to control the overlapping, Hurdles to Progress in Long-form Question Answering offers two specific solutions:\nAutomatically retrieving paraphrases and then running human validation to eliminate them.\nHolding out entire genres or domains to reduce the possibility of overlap — for example, keeping Q/A on Sports only in the held-out sets.\nTherefore, we built our abridged but categorized version of the ELI5 dataset using posts in the subreddit from 2017 to 2021, which named as ELI5_Category. Our dataset contains more than 100,000 questions and 220,000 answers.\nThe dataset is split into 1 training set, 2 validation sets, and 1 test set according to the category. The number of questions contain in each set is listed below.\n\nTrain\nValid\nValid2\nTest\nBiology\n32769\n\n\n\nChemistry\n6633\n\n\n\nCulture\n\n5446\n\n\nEarth Science\n677\n\n\n\nEconomics\n5901\n\n\n\nEngineering\n\n\n\n5411\nMathematics\n1912\n\n\n\nOther\n19312\n\n\n\nPhysics\n10196\n\n\n\nPsychology\n338\n\n\n\nTechnology\n14034\n\n\n\nRepost\n\n\n2375\n\nTotal\n91772\n5446\n2375\n5411\nSome simple aggregations on the ELI5 data will reveal that:\ncategory\nmean_top_score\nmean_all_score\nmean_answer_num\n1 Biology\n205.\n114.\n2.37\n2 Chemistry\n197.\n114.\n2.15\n3 Earth Science\n170.\n81.9\n2.54\n4 Economics\n141.\n75.3\n2.84\n5 Mathematics\n209.\n108.\n2.66\n6 Other\n133.\n72.1\n2.62\n7 Physics\n136.\n78.4\n2.24\n8 Psychology\n159.\n78.4\n2.60\n9 Technology\n169.\n91.7\n2.43\n10 Culture\n162.\n79.7\n3.14\n11 Repost\n281.\n158.\n2.56\n12 Engineering\n179.\n92.5\n2.58\nsummary-statsWhy reposts have higer scores:\nPosts with more reposts tend to contain trending topcis, which means users are more motivated to answer.\nHiger scores of reposts can come from higher correctness of the solution, that’s also why those questions are frequently reposted.\nReposts are not classified by category intentionally, indicating that using the reposts as training set may lead to overlapping problems.\n\n2.5 Ground Truth\nSince answers are generated based on pre-existing knowledges, the model need to find supporting documents for questions first. Here, we use the wiki_snippets(wiki40b_en_100_0) dataset as the ground truth to support the model answering those questions. This wikipedia dataset contains more than 17,500,000 snippets from Wikipedia.\n3. Model\n3.1 Two-stage Model Structure\n > Credit: Yacine Jernite\nOur LFQA model has a two-stage model structure: Retriever-Generator. First, document retriever model selects a set of Wikipedia passages that relevant to the input questions as supporting documents. Then, the answer generator model takes the concatenation of the input question and supporting documents as input and writes the answer.\n3.2 Retrierver: BERT + Faiss\n > Credit: Yacine Jernite\nThe retriever model is based on a pretrained BERT-like structure, but with an additional linear layer that projects the BERT output down to 128 dimensions embeddings. The projection layer is finetuned using QA pairs in training set to minimize the dot-product between question embedding and answer embedding.\n > Credit: Yacine Jernite\nTo find the best relevant supporting documents, we do a Approximate Nearest Neighbor search with all Wikipedia passages’ embedding vectors. The ANN search is accelerated by pre-clustering Wikipedia embeddings using Facebook’s faiss library.\n3.3 Generator: BART\n > Credit: Papers with Code\nBART is a denoising autoencoder for pretraining sequence-to-sequence models. It is trained by (1) corrupting text with an arbitrary noising function, and (2) learning a model to reconstruct the original text. It uses a standard seq2seq/NMT architecture with a bidirectional encoder (like BERT) and a left-to-right decoder (like GPT). In our work, we input the question and supporting documents to the BART model and use model outputs as answers.\n4. Results\n4.1 Model Training\n4.1.1 Retrierver\nA pretrained BERT(google/bert_uncased_L-8_H-768_A-12) model is fine-tuned on the training set for 10 epochs.\n\nGPU: RTX 2080S, epoch: 26 min, total: 4.5 hours, checkpoint size: 930 MB\n\nThe 128-dimensional embeddings of training/validation sets and all wiki_snippets are calculated and saved to binary files.\n\nGPU: RTX 2080S, training/validation sets: 4 hours, wiki_snippets: 11 hours\n\nThe top 10 related snippets are then retrieved as supporting documents using pre-calculated embeddings. Due to large memory requirement, this step is performed on a intel i7-9700K CPU with 48 GB DDR4 memory which takes 5 minutes.\n4.1.2 Generator\nA pretained BART(bart-base) model is fine-tuned on all answers in the training set with pre-retrieved supporting documents for 3 epochs. Due to large memory requirement, this step is performed on Google Colab with Colab Pro.\n\nGPU: Colab Pro, epoch: 4.5 hours, total: 14 hours, checkpoint size: 1.55 GB\n\nSince BART(bart-large) model contains 2.8x parameters (400M vs 140M) comparing to bart-base. We expected to get more reasonable outputs from that model. Therefore, two subsets of training set are used to fine-tune for 10 epochs: (1) 6633 questions and their 1st answers in Chemistry category; (2) first 6633 questions and their 1st answers from training set in multiple categories.\n\nGPU: Colab Pro, epoch: 28 min, total: 5 hours, checkpoint size: 4.54 GB\n\n4.2 Model Comparison\n4.2.1 The Absence of ROGUE Metric\nAs mentioned earlier, the ROGUE metric used in the evaluation of the model performance is problematic as it gives higher score to some seemingly nonsense generated answers while underestimating the top answers.\nTo make our life easier, we decide to evaluate the performance of a model based on our intuitive judgement.\n4.2.2 Learning Rate Tuning\nNote that changing settings of the retriever model requires us to re-calculate the 128d embeddings and re-train the generator model, so tuning of model settings are only performed on the generator model.\nmodel\ndataset\nsize\nlearning rate\nepochs\nnote\nbart-base\nfull eli5c\n224088\n\\(2\\times10^{-4}\\)\n3\nsuccess\nbart-large\nchemistry\n6633\n\\(2\\times10^{-4}\\)\n3\nfail to converge at epoch0\nbart-large\nchemistry\n6633\n\\(2\\times10^{-3}\\)\n10\nfail to converge at epoch0\nbart-large\nchemistry\n6633\n\\(2\\times10^{-4}\\)\n10\nfail to converge at epoch0\nbart-large\nchemistry\n6633\n\\(1\\times10^{-4}\\)\n10\nsuccess until epoch9\nbart-large\nchemistry\n6633\n\\(5\\times10^{-5}\\)\n10\nsuccess\nbart-large\nrandom\n6633\n\\(1\\times10^{-4}\\)\n10\nfail to converge at epoch0\nbart-large\nrandom\n6633\n\\(5\\times10^{-5}\\)\n10\nsuccess\n\nWe didn’t capture the interim model training outputs of “failed” or overfitted models.\n\nloss-functions4.2.3 Sample QAs\n\neli5c_reddit_test📊 (Sample answers from various models.)\n\n5. Limitations and Reflections\nDue to the limitation of computational power, we cannot train the model with both enough epochs and enough categories coverage. So we either pick a smaller subset to run more epochs, or train the model on the complete dataset but with a few epochs. In contrast, Facebook’s trial was conducted on 4 GPUs with 3 epochs (18 hours per epoch).\nHowever, our selected models seem to have a decent performance with less training time and data.\nIt’s hard to measure how our model performs after all. No scientific evaluation metrics are involved. A possible solution is to use crowdsourcing human evaluation to grade the generated answers by correctness and some other linguistic dimensions. Again, this could be both time-consuming since the evaluators need extended time to learn some facts about the question themselves if they are no experts in those areas.\n6. Demo Showcase\nAs proposed in the proposal, a prototype of open-ended question-answering website is hosted as a deliverable. The model behind it is bart-large(dataset: random6633, learning rate: 5e-5). Although the model was trained with a small subset of the entire QA dataset, it actually delivers some seemingly meaningful answers.\nInteractive Demo (deployed on personal PC, if not work, try the backup video demo📼.)\n\nGitHub Repository🐱\nColab Playground🧪 (Need GU email or permission to access.).\nWorking notebook📙.\n\njsgao/eli5_category📚\n\nReferences\nIntroducing long-form question answering\nExplain Anything Like I’m Five: A Model for Open Domain Long Form Question Answering\nELI5\nGitHub repository\nPaper\n\nProgress and Challenges in Long-Form Open-Domain Question Answering\nHurdles to Progress in Long-form Question Answering\nwiki40b, clean-up text for 40+ Wikipedia languages editions of pages correspond to entities.\n\n\n\n",
    "preview": "posts/2021-12-01-eli5c/images/eli5c.jpg",
    "last_modified": "2022-01-01T20:38:35-05:00",
    "input_file": {}
  }
]
